tap "aws/tap"
tap "music-assistant/tap"
# tap "sdkman/tap"

# C/C++ tools
brew "bazel"
brew "cmake"

# Java tools
# brew "sdkman-cli"

# JavaScript
brew "nvm"

# Version control
brew "gh"
brew "mercurial"
brew "git"

# Compression Tools
brew "zlib"
# brew "pigz"

# cURL but not Curly
brew "wget"
brew "nmap"

# Ruby
brew "openssl@3"
brew "rbenv"

# Go
brew "go"

# Deployment software
brew "aws/tap/copilot-cli"
brew "awscli"
brew "pscale"

# Editors and terminals
brew "neovim"
brew "tmux"
brew "tmuxinator"
cask "ghostty"

# Casks:

# Editors and terminals
cask "alacritty"
cask "wezterm"
cask "emacs"
cask "vscodium"
cask "eloston-chromium"
cask "google-chrome"
cask "tableplus"

# IRC
cask "halloy"

# Fancy mouse movment
cask "linearmouse"

# Monitor control
cask "MonitorControl"

# Money money money
cask "gnucash"

# Music companion
cask "music-assistant/tap/companion"

# Ansible
brew "pipx"

# Gitbutler
brew "mysql@8.0"
brew "vips"
brew "imagemagick"
brew "protobuf" # Client itself

# Music
cask "spotify"
